ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    cat = Cat.new(cat_params)
    if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["birth_date", "2013-08-12"], ["color", "white"], ["name", "Mike III"], ["description", "App Aacdemy kitty baby"], ["updated_at", "2019-09-03 21:19:35.771985"], ["id", 7]]
---
  def update
    cat = Cat.find(params[:id])

    if cat.update(cat_params)